# Select row

In [2]:
import pandas as pd

In [3]:
friend_list = [
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_items(friend_list)

/Users/shinchan-yeop/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [4]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## using index

In [6]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [7]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [8]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## using column value

In [9]:
df_filtered = df[df.age > 25]

In [10]:
df_filtered

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [11]:
df_filtered = df.query('age>25')

In [12]:
df_filtered

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [13]:
df_filtered = df[(df.age > 25) & (df.name == 'Nate')]

In [14]:
df_filtered

   name  age      job
2  Nate   30  teacher

In [17]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# Column filtering

## by indexing

In [18]:
friend_list = [['John',20,'student'],['Jenny',30,'developer'],['Nate',30,'teacher']]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [19]:
df.iloc[:, 0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [20]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

## by column name

In [23]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [24]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [25]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [26]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [40]:
#select columns contatining 'a'
df.filter(like = 'a', axis = 1) #axis == 0 : row, axis == 1 : column

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [33]:
#select columns using regex
df.filter(regex='b$', axis = 1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

# Drop row

In [41]:
friend_dict_list = [{'age':20, 'job': 'student'},
                   {'age':30, 'job': 'developer'},
                   {'age':30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, index = ['John','Jenny','Nate'])

In [42]:
df.head()

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

In [43]:
df.drop(['John','Nate'])

       age        job
Jenny   30  developer

it doesnt save in dataframe

In [44]:
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

In [45]:
df = df.drop(['John', 'Nate'])

In [46]:
df

       age        job
Jenny   30  developer

it can be saved in dataframe